; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c6-s2-p4-a1)

(:domain logistics)

(:objects a0 - airplane
          c0 c1 c2 c3 c4 c5 - city
          t0 t1 t2 t3 t4 t5 t6 t7 t8 t9 t10 - truck
          l0-0 l1-0 l2-0 l3-0 l4-0 l5-0 - airport
          l0-1 l1-1 l2-1 l3-1 l4-1 l5-1 - location
          p0 p1 p2 p3 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (in-city  l2-0 c2)
    (in-city  l2-1 c2)
    (in-city  l3-0 c3)
    (in-city  l3-1 c3)
    (in-city  l4-0 c4)
    (in-city  l4-1 c4)
    (in-city  l5-0 c5)
    (in-city  l5-1 c5)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-1)
    (at t4 l4-0)
    (at t5 l5-0)
    (at t6 l0-0)
    (at t7 l1-1)
    (at t8 l0-1)
    (at t9 l3-0)
    (at t10 l1-0)
    (at p0 l2-1)
    (at p1 l2-0)
    (at p2 l1-0)
    (at p3 l1-0)
    (at a0 l0-0)
)

(:goal
    (and
        (at p0 l2-1)
        (at p1 l3-1)
        (at p2 l0-1)
        (at p3 l0-1)
    )
)
)

; plan
1. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 1 of 4
2. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 4
3. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 1 of 4
4. (drive t4 l4-0 l4-1)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 1 of 4
5. (drive t6 l0-0 l0-1)
   deleted: (at t6 l0-0)
   added: (at t6 l0-1)
   goals met: 1 of 4
6. (fly a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 1 of 4
7. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 1 of 4
8. (drive t4 l4-1 l4-0)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 1 of 4
9. (drive t5 l5-0 l5-1)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 1 of 4
10. (drive t6 l0-1 l0-0)
   deleted: (at t6 l0-1)
   added: (at t6 l0-0)
   goals met: 1 of 4
11. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 1 of 4
12. (load a0 p1 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 a0)
   goals met: 1 of 4
13. (fly a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 1 of 4
14. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 4
15. (drive t10 l1-0 l1-1)
   deleted: (at t10 l1-0)
   added: (at t10 l1-1)
   goals met: 1 of 4
16. (drive t4 l4-0 l4-1)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 1 of 4
17. (drive t5 l5-1 l5-0)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 1 of 4
18. (load a0 p2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 1 of 4
19. (load a0 p3 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a0)
   goals met: 1 of 4
20. (fly a0 l1-0 l4-0)
   deleted: (at a0 l1-0)
   added: (at a0 l4-0)
   goals met: 1 of 4
21. (drive t10 l1-1 l1-0)
   deleted: (at t10 l1-1)
   added: (at t10 l1-0)
   goals met: 1 of 4
22. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 1 of 4
23. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 4
24. (drive t5 l5-0 l5-1)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 1 of 4
25. (drive t6 l0-0 l0-1)
   deleted: (at t6 l0-0)
   added: (at t6 l0-1)
   goals met: 1 of 4
26. (drive t9 l3-0 l3-1)
   deleted: (at t9 l3-0)
   added: (at t9 l3-1)
   goals met: 1 of 4
27. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 1 of 4
28. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 4
29. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 1 of 4
30. (drive t6 l0-1 l0-0)
   deleted: (at t6 l0-1)
   added: (at t6 l0-0)
   goals met: 1 of 4
31. (drive t7 l1-0 l1-1)
   deleted: (at t7 l1-0)
   added: (at t7 l1-1)
   goals met: 1 of 4
32. (drive t8 l0-1 l0-0)
   deleted: (at t8 l0-1)
   added: (at t8 l0-0)
   goals met: 1 of 4
33. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 4
34. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 4
35. (drive t9 l3-1 l3-0)
   deleted: (at t9 l3-1)
   added: (at t9 l3-0)
   goals met: 1 of 4
36. (fly a0 l4-0 l0-0)
   deleted: (at a0 l4-0)
   added: (at a0 l0-0)
   goals met: 1 of 4
37. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 4
38. (drive t2 l2-1 l2-0)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 1 of 4
39. (drive t3 l3-1 l3-0)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 1 of 4
40. (drive t4 l4-1 l4-0)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 1 of 4
41. (drive t6 l0-0 l0-1)
   deleted: (at t6 l0-0)
   added: (at t6 l0-1)
   goals met: 1 of 4
42. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 1 of 4
43. (unload a0 p2 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 1 of 4
44. (unload a0 p3 l0-0)
   deleted: (in p3 a0)
   added: (at p3 l0-0)
   goals met: 1 of 4
45. (fly a0 l0-0 l3-0)
   deleted: (at a0 l0-0)
   added: (at a0 l3-0)
   goals met: 1 of 4
46. (drive t0 l0-1 l0-0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 1 of 4
47. (drive t10 l1-0 l1-1)
   deleted: (at t10 l1-0)
   added: (at t10 l1-1)
   goals met: 1 of 4
48. (drive t4 l4-0 l4-1)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 1 of 4
49. (drive t6 l0-1 l0-0)
   deleted: (at t6 l0-1)
   added: (at t6 l0-0)
   goals met: 1 of 4
50. (drive t7 l1-0 l1-1)
   deleted: (at t7 l1-0)
   added: (at t7 l1-1)
   goals met: 1 of 4
51. (unload a0 p1 l3-0)
   deleted: (in p1 a0)
   added: (at p1 l3-0)
   goals met: 1 of 4
52. (fly a0 l3-0 l5-0)
   deleted: (at a0 l3-0)
   added: (at a0 l5-0)
   goals met: 1 of 4
53. (drive t1 l1-1 l1-0)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 4
54. (drive t10 l1-1 l1-0)
   deleted: (at t10 l1-1)
   added: (at t10 l1-0)
   goals met: 1 of 4
55. (drive t2 l2-0 l2-1)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 1 of 4
56. (drive t5 l5-1 l5-0)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 1 of 4
57. (drive t6 l0-0 l0-1)
   deleted: (at t6 l0-0)
   added: (at t6 l0-1)
   goals met: 1 of 4
58. (drive t7 l1-1 l1-0)
   deleted: (at t7 l1-1)
   added: (at t7 l1-0)
   goals met: 1 of 4
59. (drive t9 l3-0 l3-1)
   deleted: (at t9 l3-0)
   added: (at t9 l3-1)
   goals met: 1 of 4
60. (fly a0 l5-0 l3-0)
   deleted: (at a0 l5-0)
   added: (at a0 l3-0)
   goals met: 1 of 4
61. (load t0 p2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 1 of 4
62. (load t0 p3 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 1 of 4
63. (load t3 p1 l3-0)
   deleted: (at p1 l3-0)
   added: (in p1 t3)
   goals met: 1 of 4
64. (drive t0 l0-0 l0-1)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 1 of 4
65. (drive t3 l3-0 l3-1)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 4
66. (drive t1 l1-0 l1-1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 4
67. (drive t4 l4-1 l4-0)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 1 of 4
68. (drive t5 l5-0 l5-1)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 1 of 4
69. (drive t6 l0-1 l0-0)
   deleted: (at t6 l0-1)
   added: (at t6 l0-0)
   goals met: 1 of 4
70. (unload t0 p2 l0-1)
   deleted: (in p2 t0)
   added: (at p2 l0-1)
   goals met: 2 of 4
71. (unload t0 p3 l0-1)
   deleted: (in p3 t0)
   added: (at p3 l0-1)
   goals met: 3 of 4
72. (unload t3 p1 l3-1)
   deleted: (in p1 t3)
   added: (at p1 l3-1)
   goals met: 4 of 4
